src/ex_Tabakon/InformationRegisters/ТБКСменыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТБКСменыСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипПродавца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/CommonForms/ТБКФормаВыбораТипаПродавцаИВремениРаботы/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НеНадоПроверять = Ложь тогда 		
		если не ЗначениеЗаполнено(Продавец) тогда
			Отказ = Истина;
			Сообщить("Не заполнен продавец!");
		КонецЕсли;
		
		если не ЗначениеЗаполнено(КассаККМ) тогда
			Отказ = Истина;
			Сообщить("Не заполнена КассаККМ!");
		КонецЕсли;

		
		Если ВторойПродавец + ОсновнойПродавец + МладшийПродавец <> 1 тогда
			Отказ = Истина;
			Сообщить("Выберите тип продавца! Только 1 тип возможен.");	
		КонецЕсли;
		
		Если ВремяСмены = 0 тогда
			Отказ = Истина;
			Сообщить("Не заполнено время смены!");
		КонецЕсли;
		
		Если ВремяСмены > 24 тогда
			Отказ = Истина;
			Сообщить("Время смены превысило 24 ч.!");
		КонецЕсли;

		
		ЗаписатьДанные();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьТекПродавца()
	Возврат Пользователи.ТекущийПользователь().ФизическоеЛицо;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Продавец = ПолучитьТекПродавца();
КонецПроцедуры

&НаСервере
Процедура  ЗаписатьДанные()
	Рег = РегистрыСведений.ТБКСменыСотрудников.СоздатьМенеджерЗаписи();
	Рег.Период		=	ТекущаяДата();
	Рег.ВремяСмены	=	ВремяСмены;
	Рег.Продавец	=	Продавец;
	Рег.КассаККМ	=	КассаККМ;
	Если ВторойПродавец тогда
		Рег.ТипПродавца	=	"Второй продавец";
	ИначеЕсли ОсновнойПродавец тогда
		Рег.ТипПродавца	=	"Основной продавец";
	ИначеЕсли МладшийПродавец тогда
		Рег.ТипПродавца	=	"Младший продавец";
	иначе
		Рег.ТипПродавца	=	"Ночной продавец";
	КонецЕсли;
	
	Рег.Записать();		
КонецПроцедуры


&НаКлиенте
Процедура Выйти(Команда)
	НеНадоПроверять	=	истина;
	Этаформа.Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КассыККМ.Ссылка КАК КассаККМ
	               |ИЗ
	               |	Справочник.КассыККМ КАК КассыККМ
	               |ГДЕ
	               |	КассыККМ.РабочееМесто = &РабочееМесто
	               |	И КассыККМ.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("РабочееМесто",РабочееМесто);
	
	Рез = запрос.Выполнить().Выгрузить();
	Если рез.Количество() = 1 Тогда
		КассаККМ	=	Рез[0].КассаККМ;
	КонецЕсли;
		
КонецПроцедуры
